# Chapter 5: Getting Started with Pandas

In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

## 5.1: Introduction to pandas Data Structures

### Series

In [22]:
obj=Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [23]:
obj1=Series([4,6,"a",1])
obj1

0    4
1    6
2    a
3    1
dtype: object

In [24]:
obj.array

<NumpyExtensionArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

In [25]:
obj=pd.Series([4,7,5,-3])
obj

0    4
1    7
2    5
3   -3
dtype: int64

In [26]:
obj.array

<NumpyExtensionArray>
[4, 7, 5, -3]
Length: 4, dtype: int64

In [27]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [28]:
obj2=Series([4,7,-5,3],index=["d","b","a","c"])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [29]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [30]:
obj2["a"]

-5

In [31]:
obj2["d"]=6

In [32]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [33]:
obj2[["c","a","d"]]

c    3
a   -5
d    6
dtype: int64

In [34]:
obj2[[3,2,1]]

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_7596\3951335562.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj2[[3,2,1]]

c    3
a   -5
b    7
dtype: int64

In [35]:
obj2.iloc[[3,2,1]]

c    3
a   -5
b    7
dtype: int64

In [36]:
obj2[obj2>0]

d    6
b    7
c    3
dtype: int64

In [37]:
obj2*2

d    12
b    14
a   -10
c     6
dtype: int64

In [38]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [39]:
"b" in obj2

True

In [40]:
"e" in obj2

False

In [41]:
sdata={"Ohio":35000,"Texas":71000,"Oregon":16000,"Utah":5000}

In [42]:
sdata

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [43]:
obj3=Series(sdata)

In [44]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [45]:
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [46]:
states=["California","Ohio","Oregon","Texas"]
obj4=Series(sdata,index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [47]:
pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [48]:
pd.notna(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [49]:
obj4.isna()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [50]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [51]:
obj3
obj4

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [52]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [53]:
obj4.name

In [54]:
obj4.name="population"
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [55]:
obj4.index

Index(['California', 'Ohio', 'Oregon', 'Texas'], dtype='object')

In [56]:
obj4.index.name="state"

In [57]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [58]:
obj

0    4
1    7
2    5
3   -3
dtype: int64

In [59]:
obj.index=["Bob","Steve","Jeff","Ryan"]
obj

Bob      4
Steve    7
Jeff     5
Ryan    -3
dtype: int64

### DataFrame

In [60]:
data={"state":["Ohio","Ohio","Ohio","Nevada","Nevada","Nevada"],
      "year":[200,2001,2002,2001,2002,2003],
      "pop":[1.5,1.7,3.6,2.4,2.9,3.2]}
data

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [200, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [61]:
frame=DataFrame(data)
frame

    state  year  pop
0    Ohio   200  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [62]:
frame.head()

    state  year  pop
0    Ohio   200  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [63]:
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [64]:
DataFrame(data,columns=["year","state","pop"])

   year   state  pop
0   200    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [65]:
frame2=pd.DataFrame(data,columns=["year","state","pop","debt"])
frame2

   year   state  pop debt
0   200    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [66]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [67]:
frame2["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [68]:
frame2.year

0     200
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [69]:
frame2["year"][0]=2000

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_7596\2766672876.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  frame2["year"][0]=2000

In [70]:
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [71]:
frame2.loc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [72]:
frame2.iloc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [73]:
frame2["debt"]=16.5
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [74]:
frame2["debt"]=np.arange(6.)
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [75]:
val=Series([-1.2,-1.5,-1.7],index=[2,4,5])
frame2["debt"]=val
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6  -1.2
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9  -1.5
5  2003  Nevada  3.2  -1.7

In [76]:
frame2["eastern"]=frame2["state"]=="Ohio"

In [77]:
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6  -1.2     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9  -1.5    False
5  2003  Nevada  3.2  -1.7    False

In [78]:
del frame2["eastern"]

In [79]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6  -1.2
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9  -1.5
5  2003  Nevada  3.2  -1.7

In [80]:
populations={"Ohio":{2000:1.5,2001:1.7,2002:3.6},
             "Nevada":{2001:2.4,2002:2.9}}

In [81]:
frame3=DataFrame(populations)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [82]:
frame3.index

Index([2000, 2001, 2002], dtype='int64')

In [83]:
frame3.index.name="Year"

In [84]:
frame3

      Ohio  Nevada
Year
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [85]:
frame3.T

Year    2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [86]:
DataFrame(populations,index=[2001,2002,2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [87]:
frame3["Ohio"][:-1]

Year
2000    1.5
2001    1.7
Name: Ohio, dtype: float64

In [88]:
pdata={"Ohio":frame3["Ohio"][:-1],
       "Nevada":frame3["Nevada"][:2]}
DataFrame(pdata)

      Ohio  Nevada
Year
2000   1.5     NaN
2001   1.7     2.4

In [89]:
frame3.index.name

'Year'

In [90]:
frame3.columns.name="state"

In [91]:
frame3

state  Ohio  Nevada
Year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [92]:
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

In [93]:
frame3.to_json()

'{"Ohio":{"2000":1.5,"2001":1.7,"2002":3.6},"Nevada":{"2000":null,"2001":2.4,"2002":2.9}}'

In [94]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6  -1.2
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9  -1.5
5  2003  Nevada  3.2  -1.7

In [95]:
frame2.to_numpy()

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, -1.2],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, -1.5],
       [2003, 'Nevada', 3.2, -1.7]], dtype=object)

### Index Objects

In [96]:
obj=Series(np.arange(3))

In [97]:
obj

0    0
1    1
2    2
dtype: int32

In [98]:
obj.index

RangeIndex(start=0, stop=3, step=1)

In [99]:
obj=Series(np.arange(3),index=["a","b","c"])

In [100]:
obj

a    0
b    1
c    2
dtype: int32

In [101]:
obj.index

Index(['a', 'b', 'c'], dtype='object')

In [102]:
index=obj.index
index[1:]

Index(['b', 'c'], dtype='object')

In [103]:
index[1]="d"

TypeError: Index does not support mutable operations

In [ ]:
labels=pd.Index(np.arange(3))
labels

Index([0, 1, 2], dtype='int32')

In [ ]:
obj2=Series([1.5,-2.5,0],index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [ ]:
obj2.index

Index([0, 1, 2], dtype='int32')

In [ ]:
obj2.index is labels

True

In [104]:
frame3

state  Ohio  Nevada
Year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [105]:
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object', name='state')

In [106]:
"Ohio" in frame3.columns

True

In [107]:
frame3.index

Index([2000, 2001, 2002], dtype='int64', name='Year')

In [108]:
2003 in frame3.index

False

In [109]:
pd.Index(["foo","foo","bar","bar","bar"])

Index(['foo', 'foo', 'bar', 'bar', 'bar'], dtype='object')

In [110]:
objx=Series(np.arange(5))
objx

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [111]:
objx.index=pd.Index(["foo","foo","bar","bar","bar"])

In [112]:
objx

foo    0
foo    1
bar    2
bar    3
bar    4
dtype: int32

## 5.2: Essential Functionality

### Reindexing

In [113]:
obj=Series([4.5,7.2,-5.3,3.6],index=["d","b","a","c"])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [114]:
obj2=obj.reindex(["a","b","c","d","e"])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [115]:
obj3=pd.Series(["blue","purple","yellow"],index=[0,2,4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [116]:
obj3.reindex(np.arange(6),method="ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [120]:
frame=DataFrame(np.arange(9).reshape((3,3)),
                index=["a","c","d"],
                columns=["Ohio","Texas","California"])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [121]:
frame2=frame.reindex(index=["a","b","c","d"])

In [122]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [123]:
states=["Texas","Utah","California"]
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [124]:
frame.reindex(states,axis="columns")

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [126]:
frame.loc[["a","d","c"],["California","Texas"]]

   California  Texas
a           2      1
d           8      7
c           5      4

In [127]:
frame.loc[["California","Texas"],["a","d","c"]]

KeyError: "None of [Index(['California', 'Texas'], dtype='object')] are in the [index]"

In [129]:
frame.loc[["a"]]

   Ohio  Texas  California
a     0      1           2

### Dropping Entries from an Axis

In [130]:
obj=Series(np.arange(5),index=["a","b","c","d","e"])
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [131]:
new_obj=obj.drop("c")
new_obj

a    0
b    1
d    3
e    4
dtype: int32

In [132]:
obj.drop(["d","c"])

a    0
b    1
e    4
dtype: int32

In [133]:
data=pd.DataFrame(np.arange(16).reshape((4,4)),
                  index=["Ohio","Colorado","Utah","New York"],
                  columns=["one","two","three","four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [134]:
data.drop(index=["Colorado","Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [135]:
data.drop(columns="two")

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [136]:
data.drop("two",axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [138]:
data.drop(["two","four"],axis="columns")

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [140]:
data.drop(["two","four"],axis=0)

KeyError: "['two', 'four'] not found in axis"

### Indexing, Selection, and Filtering

In [141]:
obj=Series(np.arange(4),index=["a","b","c","d"])
obj

a    0
b    1
c    2
d    3
dtype: int32

In [142]:
obj["b"]

1

In [143]:
obj[1]

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_7596\2469632899.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[1]

1

In [144]:
obj[2:4]

c    2
d    3
dtype: int32

In [145]:
obj[2:3]

c    2
dtype: int32

In [146]:
obj[["b","a","d"]]

b    1
a    0
d    3
dtype: int32

In [147]:
obj[[1,3]]

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_7596\1781339481.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[[1,3]]

b    1
d    3
dtype: int32

In [148]:
obj[obj<2]

a    0
b    1
dtype: int32

In [149]:
obj.loc[["b","a","d"]]

b    1
a    0
d    3
dtype: int32

In [150]:
obj1=Series([1,2,3],index=[2,0,1])
obj2=Series([1,2,3],index=["a","b","c"])
obj1
obj2

2    1
0    2
1    3
dtype: int64

a    1
b    2
c    3
dtype: int64

In [151]:
obj1[[0,1,2]]

0    2
1    3
2    1
dtype: int64

In [152]:
obj2[[0,1,2]]

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_7596\2179584337.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj2[[0,1,2]]

a    1
b    2
c    3
dtype: int64

In [153]:
obj2.loc[[0,1,2]]

KeyError: "None of [Index([0, 1, 2], dtype='int32')] are in the [index]"

In [154]:
obj1.iloc[[0,1,2]]

2    1
0    2
1    3
dtype: int64

In [155]:
obj2.iloc[[0,1,2]]

a    1
b    2
c    3
dtype: int64

In [156]:
obj2.loc["b":"c"]

b    2
c    3
dtype: int64

In [157]:
obj2

a    1
b    2
c    3
dtype: int64

In [158]:
obj2["b":"c"]=5
obj2

a    1
b    5
c    5
dtype: int64

In [159]:
data=DataFrame(np.arange(16).reshape((4,4)),
               index=["Ohio","Colorado","Utah","New York"],
               columns=["one","two","three","four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [160]:
data["two"]

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [161]:
data[["two"]]

          two
Ohio        1
Colorado    5
Utah        9
New York   13

In [162]:
data[["three","one"]]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [163]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [164]:
data[data["three"]>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [165]:
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [166]:
data[data<5]=0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

#### Selection on DataFrame with loc and iloc

In [167]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [168]:
data.loc["Colorado"]

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int32

In [169]:
data.loc[["Colorado","New York"]]

          one  two  three  four
Colorado    0    5      6     7
New York   12   13     14    15

In [170]:
data.loc["Colorado",["two","three"]]

two      5
three    6
Name: Colorado, dtype: int32

In [173]:
data.loc[["Colorado"],["two","three"]]

          two  three
Colorado    5      6

In [179]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [174]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [175]:
data.iloc[[2,1]]

          one  two  three  four
Utah        8    9     10    11
Colorado    0    5      6     7

In [180]:
data.iloc[[1],[1,2]]

          two  three
Colorado    5      6

In [181]:
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [182]:
data.iloc[[2],[3,0,1]]

      four  one  two
Utah    11    8    9

In [183]:
data.iloc[[1,2],[3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [184]:
data.loc[:"Utah","two"]

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [187]:
data.loc[:"Utah",["two"]]

          two
Ohio        0
Colorado    5
Utah        9

In [192]:
data.iloc[:,:3][data.three>5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [194]:
data.loc[data.three>=2]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [196]:
data[data.three>=2]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

#### Integer Indexing pitfalls

In [197]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [198]:
ser[-1]

KeyError: -1

In [199]:
ser2=Series(np.arange(3),index=["a","b","c"])
ser2

a    0
b    1
c    2
dtype: int32

In [200]:
ser2[-1]

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_7596\811950851.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser2[-1]

2

In [201]:
ser.iloc[-1]

2.0

In [203]:
ser2.iloc[-1]

2

In [204]:
ser.loc[-1]

KeyError: -1

In [205]:
ser2.loc[-1]

KeyError: -1

In [206]:
ser[:2]

0    0.0
1    1.0
dtype: float64

#### Pitfalls with chained indexing

In [207]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [208]:
data.loc[:,"one"]

Ohio         0
Colorado     0
Utah         8
New York    12
Name: one, dtype: int32

In [209]:
data.loc[:, "one"] = 1
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        1    9     10    11
New York    1   13     14    15

In [210]:
data.iloc[2]

one       1
two       9
three    10
four     11
Name: Utah, dtype: int32

In [211]:
data.iloc[2]=5
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        5    5      5     5
New York    1   13     14    15

In [212]:
data.loc[data["four"]>5]=3
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

In [214]:
data["four"]>5

Ohio        False
Colorado    False
Utah        False
New York    False
Name: four, dtype: bool

In [217]:
data.loc[data.three==5]["three"]=6

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_7596\3936912511.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data.loc[data.three==5]["three"]=6

In [218]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

In [219]:
data.loc[data.three==5,"three"]=6
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      6     5
New York    3    3      3     3

### Arithmetic and Data Alignment

In [220]:
s1=Series([7.3,-2.5,3.4,1.5],index=["a","c","d","e"])
s2=Series([-2.1,3.6,-1.5,4,3.1],index=["a","c","e","f","g"])
s1
s2

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [221]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [222]:
df1=DataFrame(np.arange(9).reshape((3,3)),
              columns=list("bcd"),
              index=["Ohio","Texas","Colorado"])

df2=DataFrame(np.arange(12).reshape((4,3)),
              columns=list("bde"),
              index=["Utah","Ohio","Texas","Oregon"])

In [223]:
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [224]:
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [225]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [2]:
df1=DataFrame({"A":[1,2]})
df2=DataFrame({"B":[3,4]})
df1
df2

   A
0  1
1  2

   B
0  3
1  4

In [3]:
df1+df2

    A   B
0 NaN NaN
1 NaN NaN

#### Arithmetic methods with fill values

In [4]:
df1=DataFrame(np.arange(12).reshape((3,4)),
              columns=list("abcd"))
df2=DataFrame(np.arange(20).reshape((4,5)),
              columns=list("abcde"))
df1
df2

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [5]:
df2.loc[1,"b"]=np.nan
df2

    a     b   c   d   e
0   0   1.0   2   3   4
1   5   NaN   7   8   9
2  10  11.0  12  13  14
3  15  16.0  17  18  19

In [6]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [7]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [8]:
1/df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [9]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [11]:
df1.reindex(columns=df2.columns,fill_value=0)

   a  b   c   d  e
0  0  1   2   3  0
1  4  5   6   7  0
2  8  9  10  11  0

#### Operations between DataFrame and Series

In [14]:
arr=np.arange(12).reshape((3,4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [15]:
arr[0]

array([0, 1, 2, 3])

In [16]:
arr-arr[0]

array([[0, 0, 0, 0],
       [4, 4, 4, 4],
       [8, 8, 8, 8]])

In [17]:
frame=DataFrame(np.arange(12).reshape((4,3)),
                columns=list("bde"),
                index=["Utah","Ohio","Texas","Oregon"])
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [20]:
series=frame.iloc[0]
series

b    0
d    1
e    2
Name: Utah, dtype: int32

In [21]:
frame-series

        b  d  e
Utah    0  0  0
Ohio    3  3  3
Texas   6  6  6
Oregon  9  9  9

In [23]:
series2=Series(np.arange(3),index=list("bef"))
series2

b    0
e    1
f    2
dtype: int32

In [24]:
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [25]:
frame+series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [26]:
series3=frame["d"]
frame
series3

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

Utah       1
Ohio       4
Texas      7
Oregon    10
Name: d, dtype: int32

In [31]:
frame.sub(series3,axis="index")

        b  d  e
Utah   -1  0  1
Ohio   -1  0  1
Texas  -1  0  1
Oregon -1  0  1

In [33]:
frame-series3
series3-frame

        Ohio  Oregon  Texas  Utah   b   d   e
Utah     NaN     NaN    NaN   NaN NaN NaN NaN
Ohio     NaN     NaN    NaN   NaN NaN NaN NaN
Texas    NaN     NaN    NaN   NaN NaN NaN NaN
Oregon   NaN     NaN    NaN   NaN NaN NaN NaN

        Ohio  Oregon  Texas  Utah   b   d   e
Utah     NaN     NaN    NaN   NaN NaN NaN NaN
Ohio     NaN     NaN    NaN   NaN NaN NaN NaN
Texas    NaN     NaN    NaN   NaN NaN NaN NaN
Oregon   NaN     NaN    NaN   NaN NaN NaN NaN

### Function Application and Mapping

In [34]:
frame=DataFrame(np.random.standard_normal((4,3)),
                columns=list("bde"),
                index=["Utah","Ohio","Texas","Oregon"])
frame

               b         d         e
Utah   -0.577570 -0.857792  1.864787
Ohio    0.355861 -0.815387  0.159835
Texas   0.727265 -0.759075  1.493617
Oregon  0.559373 -1.492150 -0.771737

In [35]:
np.abs(frame)

               b         d         e
Utah    0.577570  0.857792  1.864787
Ohio    0.355861  0.815387  0.159835
Texas   0.727265  0.759075  1.493617
Oregon  0.559373  1.492150  0.771737

In [36]:
def f1(x):
    return x.max()-x.min()

In [37]:
frame.apply(f1)

b    1.304836
d    0.733075
e    2.636524
dtype: float64

In [38]:
frame.apply(f1,axis="columns")

Utah      2.722579
Ohio      1.171247
Texas     2.252692
Oregon    2.051523
dtype: float64

In [39]:
def f2(x):
    return Series([x.min(),x.max()], index=["min","max"])

In [40]:
frame

               b         d         e
Utah   -0.577570 -0.857792  1.864787
Ohio    0.355861 -0.815387  0.159835
Texas   0.727265 -0.759075  1.493617
Oregon  0.559373 -1.492150 -0.771737

In [41]:
frame.apply(f2)

            b         d         e
min -0.577570 -1.492150 -0.771737
max  0.727265 -0.759075  1.864787

In [42]:
def my_format(x):
    return f"{x:.2f}"

In [45]:
frame.applymap(my_format)

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_24460\1462544007.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  frame.applymap(my_format)

            b      d      e
Utah    -0.58  -0.86   1.86
Ohio     0.36  -0.82   0.16
Texas    0.73  -0.76   1.49
Oregon   0.56  -1.49  -0.77

In [47]:
frame["e"].map(my_format)

Utah       1.86
Ohio       0.16
Texas      1.49
Oregon    -0.77
Name: e, dtype: object

### Sorting and Ranking

In [50]:
obj=Series(np.arange(4),index=list("dabc"))
obj

d    0
a    1
b    2
c    3
dtype: int32

In [51]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int32

In [52]:
frame=DataFrame(np.arange(8).reshape((2,4)),
                index=["three","one"],
                columns=["d","a","b","c"])

In [55]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [57]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [58]:
frame.sort_index(axis="columns")

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [59]:
frame.sort_index(axis="index")

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [61]:
frame.sort_index().sort_index(axis="columns")

       a  b  c  d
one    5  6  7  4
three  1  2  3  0

In [62]:
frame.sort_index(axis="columns").sort_index()

       a  b  c  d
one    5  6  7  4
three  1  2  3  0

In [64]:
frame.sort_index(axis="columns",ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [66]:
frame.sort_index(axis="columns",ascending=False).sort_index(ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [67]:
obj=Series([4,7,-3,2])
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [69]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [70]:
obj=Series([4,np.nan,7,np.nan,-3,2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [71]:
obj.sort_values(na_position="first")

1    NaN
3    NaN
4   -3.0
5    2.0
0    4.0
2    7.0
dtype: float64

In [72]:
frame=DataFrame({"b":[4,7,-3,2],"a":[0,1,0,1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [74]:
frame.sort_values("b")

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [75]:
frame.sort_values("a")

   b  a
0  4  0
2 -3  0
1  7  1
3  2  1

In [76]:
frame.sort_values(["a","b"])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [78]:
frame.sort_values(["b","a"])

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [79]:
obj=Series([7,-5,7,4,2,0,4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [80]:
obj.rank(method="first")

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [85]:
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [84]:
obj.rank(ascending=False)

0    1.5
1    7.0
2    1.5
3    3.5
4    5.0
5    6.0
6    3.5
dtype: float64

In [86]:
frame=DataFrame({"b":[4.3,7,-3,2],
                 "a":[0,1,0,1],
                 "c":[-2,5,8,-2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [87]:
frame.rank(axis="columns")

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

### Axis Indexes with Duplicate Labels

In [88]:
obj=Series(np.arange(5),index=["a","a","b","b","c"])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int32

In [89]:
obj.index.is_unique

False

In [90]:
obj["a"]

a    0
a    1
dtype: int32

In [91]:
obj["c"]

4

In [92]:
df=DataFrame(np.random.standard_normal((5,3)),
             index=["a","a","b","b","c"])
df

          0         1         2
a  0.446043 -0.999760  0.564602
a -0.816311  1.617267  1.916713
b -0.158375  1.005432 -0.124703
b  0.431413  0.370823  0.211259
c  0.433448  0.372876 -0.400344

In [94]:
df.loc["b"]

          0         1         2
b -0.158375  1.005432 -0.124703
b  0.431413  0.370823  0.211259

In [95]:
df.loc["c"]

0    0.433448
1    0.372876
2   -0.400344
Name: c, dtype: float64

In [96]:
df.loc[["c"]]

          0         1         2
c  0.433448  0.372876 -0.400344

## 5.3: Summarizing and Computing Descriptive Statistics

In [97]:
df=DataFrame([[1.4,np.nan],
              [7.1,-4.5],
              [np.nan,np.nan],
              [0.75,-1.3]],
              index=list("abcd"),
              columns=["one","two"])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [98]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [99]:
df.sum(axis="index")

one    9.25
two   -5.80
dtype: float64

In [100]:
df.sum(axis="columns")

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [102]:
df.sum(axis="index",skipna=False)

one   NaN
two   NaN
dtype: float64

In [103]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [104]:
df.sum(axis="columns",skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [105]:
df.mean(axis="columns")

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [106]:
df.idxmax()

one    b
two    d
dtype: object

In [107]:
df.idxmax(axis=1)

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_24460\3123959378.py:1: FutureWarning: The behavior of DataFrame.idxmax with all-NA values, or any-NA and skipna=False, is deprecated. In a future version this will raise ValueError
  df.idxmax(axis=1)

a    one
b    one
c    NaN
d    one
dtype: object

In [108]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [110]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [109]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [111]:
obj=Series(["a","a","b","c"]*4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [112]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### Correlation and Covariance

In [113]:
price=pd.read_pickle("../../examples/yahoo_price.pkl")
price

                  AAPL        GOOG         IBM       MSFT
Date
2010-01-04   27.990226  313.062468  113.304536  25.884104
2010-01-05   28.038618  311.683844  111.935822  25.892466
2010-01-06   27.592626  303.826685  111.208683  25.733566
2010-01-07   27.541619  296.753749  110.823732  25.465944
2010-01-08   27.724725  300.709808  111.935822  25.641571
...                ...         ...         ...        ...
2016-10-17  117.550003  779.960022  154.770004  57.220001
2016-10-18  117.470001  795.260010  150.720001  57.660000
2016-10-19  117.120003  801.500000  151.259995  57.529999
2016-10-20  117.059998  796.969971  151.520004  57.250000
2016-10-21  116.599998  799.369995  149.630005  59.660000

[1714 rows x 4 columns]

In [114]:
volume=pd.read_pickle("../../examples/yahoo_volume.pkl")
volume

                 AAPL      GOOG       IBM      MSFT
Date
2010-01-04  123432400   3927000   6155300  38409100
2010-01-05  150476200   6031900   6841400  49749600
2010-01-06  138040000   7987100   5605300  58182400
2010-01-07  119282800  12876600   5840600  50559700
2010-01-08  111902700   9483900   4197200  51197400
...               ...       ...       ...       ...
2016-10-17   23624900   1089500   5890400  23830000
2016-10-18   24553500   1995600  12770600  19149500
2016-10-19   20034600    116600   4632900  22878400
2016-10-20   24125800   1734200   4023100  49455600
2016-10-21   22384800   1260500   4401900  79974200

[1714 rows x 4 columns]

In [115]:
returns=price.pct_change()
returns

                AAPL      GOOG       IBM      MSFT
Date
2010-01-04       NaN       NaN       NaN       NaN
2010-01-05  0.001729 -0.004404 -0.012080  0.000323
2010-01-06 -0.015906 -0.025209 -0.006496 -0.006137
2010-01-07 -0.001849 -0.023280 -0.003462 -0.010400
2010-01-08  0.006648  0.013331  0.010035  0.006897
...              ...       ...       ...       ...
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

[1714 rows x 4 columns]

In [117]:
returns["MSFT"].corr(returns["IBM"])

0.4997636114415114

In [118]:
returns["MSFT"].cov(returns["IBM"])

8.870655479703546e-05

In [119]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

In [120]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000277  0.000107  0.000078  0.000095
GOOG  0.000107  0.000251  0.000078  0.000108
IBM   0.000078  0.000078  0.000146  0.000089
MSFT  0.000095  0.000108  0.000089  0.000215

In [121]:
returns.corrwith(returns["IBM"])

AAPL    0.386817
GOOG    0.405099
IBM     1.000000
MSFT    0.499764
dtype: float64

In [122]:
returns
volume

                AAPL      GOOG       IBM      MSFT
Date
2010-01-04       NaN       NaN       NaN       NaN
2010-01-05  0.001729 -0.004404 -0.012080  0.000323
2010-01-06 -0.015906 -0.025209 -0.006496 -0.006137
2010-01-07 -0.001849 -0.023280 -0.003462 -0.010400
2010-01-08  0.006648  0.013331  0.010035  0.006897
...              ...       ...       ...       ...
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

[1714 rows x 4 columns]

                 AAPL      GOOG       IBM      MSFT
Date
2010-01-04  123432400   3927000   6155300  38409100
2010-01-05  150476200   6031900   6841400  49749600
2010-01-06  138040000   7987100   5605300  58182400
2010-01-07  119282800  12876600   5840600  50559700
2010-01-08  111902700   9483900   4197200  51197400
...               ...       ...       ...       ...
2016-10-17   23624900   1089500   5890400  23830000
2016-10-18   24553500   1995600  12770600  19149500
2016-10-19   20034600    116600   4632900  22878400
2016-10-20   24125800   1734200   4023100  49455600
2016-10-21   22384800   1260500   4401900  79974200

[1714 rows x 4 columns]

In [123]:
returns.corrwith(volume)

AAPL   -0.075565
GOOG   -0.007067
IBM    -0.204849
MSFT   -0.092950
dtype: float64

In [124]:
returns["AAPL"].corr(volume["AAPL"])

-0.07556463594911404

### Unique Values, Value Counts, and Membership

In [125]:
obj=Series(["c","a","d","a","a","b","b","d","c"])
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    d
8    c
dtype: object

In [126]:
uniques=obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [127]:
obj.value_counts()

a    3
c    2
d    2
b    2
Name: count, dtype: int64

In [130]:
pd.value_counts(obj.to_numpy(),sort=False)

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_24460\2733622681.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(obj.to_numpy(),sort=False)

c    2
a    3
d    2
b    2
Name: count, dtype: int64

In [131]:
pd.value_counts(obj.to_numpy())

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_24460\4037610489.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(obj.to_numpy())

a    3
c    2
d    2
b    2
Name: count, dtype: int64

In [132]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    d
8    c
dtype: object

In [134]:
obj.isin(["b","c"])

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7    False
8     True
dtype: bool

In [135]:
obj[obj.isin(["b","c"])]

0    c
5    b
6    b
8    c
dtype: object

In [136]:
to_match=Series(["c","a","b","b","c","a"])
to_match

0    c
1    a
2    b
3    b
4    c
5    a
dtype: object

In [137]:
unique_values=Series(["c","b","a"])
unique_values

0    c
1    b
2    a
dtype: object

In [139]:
pd.Index(unique_values).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [140]:
data=DataFrame({"Qu1":[1,3,4,3,4],
                "Qu2":[2,3,1,2,3],
                "Qu3":[1,5,2,4,4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [142]:
data["Qu1"].value_counts().sort_index()

Qu1
1    1
3    2
4    2
Name: count, dtype: int64

In [144]:
data.apply(pd.value_counts).fillna(0)

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_24460\2493099384.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  data.apply(pd.value_counts).fillna(0)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [146]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [145]:
data.value_counts()

Qu1  Qu2  Qu3
1    2    1      1
3    2    4      1
     3    5      1
4    1    2      1
     3    4      1
Name: count, dtype: int64

In [147]:
data=pd.DataFrame({"a":[1,1,1,2,2],
                   "b":[0,0,1,0,0]})
data

   a  b
0  1  0
1  1  0
2  1  1
3  2  0
4  2  0

In [148]:
data.value_counts()

a  b
1  0    2
2  0    2
1  1    1
Name: count, dtype: int64

In [150]:
data=pd.DataFrame({"a":[1,1,1,2,2],
                   "b":[0,0,1,0,0],
                   "c":[1,2,1,0,1]})
data

   a  b  c
0  1  0  1
1  1  0  2
2  1  1  1
3  2  0  0
4  2  0  1

In [151]:
data.value_counts()

a  b  c
1  0  1    1
      2    1
   1  1    1
2  0  0    1
      1    1
Name: count, dtype: int64